code-review/NRB_3471_3546/База_Было/Documents/ЗаявлениеНаУчастиеВОферте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаУчастиеВОферте</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерСЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОферты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КарточкаОферты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КарточкаОферты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЦБ</Name>
					<Comment>Количество ценных бумаг, предъявляемых к оферте</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОПриемеКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияВКабинетеКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/ВебСервисыСервер/Ext/Module.bsl
Процедура ОбновитьДоговорВСУДК(ДанныеДоговора) Экспорт
	
	// Получаем старые номер и тип договора
	СтарыйКод = "";
	СтарыйТипДоговора = Перечисления.ТипыДоговоров.ПустаяСсылка();
	Если ДанныеДоговора.ЭтоНовый Тогда
		СтарыйКод = ДанныеДоговора.Код;
		СтарыйТипДоговора = ДанныеДоговора.ТипДоговора;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Код,
		|	ДоговорыКонтрагентов.ТипДоговора,
		|	ДоговорыКонтрагентов.ПометкаУдаления
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДанныеДоговора.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтарыйКод = Выборка.Код;
			СтарыйТипДоговора = Выборка.ТипДоговора;
		КонецЕсли;
	КонецЕсли;
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ВебСервисКлиенты;
	ПараметрыВнешнегоИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
	Адрес = ПараметрыВнешнегоИсточника.Папка;
	ПространствоИмен = ПараметрыВнешнегоИсточника.База;
	Прокси = ВебСервисыПовтИсп.ПолучитьПроксиСУДК();
	
	// Изменение параметров договора в СУДК, а если новый договор - его добавленние.
	Если СтарыйТипДоговора = Перечисления.ТипыДоговоров.Депозитарный Тогда
		Если (СтарыйКод <> ДанныеДоговора.Код) 
			ИЛИ (СтарыйТипДоговора <> ДанныеДоговора.ТипДоговора) 
			ИЛИ ДанныеДоговора.ПометкаУдаления Тогда
			
			// Удаляем договор из СУДК
			Попытка
				ТипПараметра = Прокси.ФабрикаXDTO.Тип(ПространствоИмен, "ContractDelete");
				Параметры = Прокси.ФабрикаXDTO.Создать(ТипПараметра);
				Параметры.clientId = ПолучитьИдентификаторКлиентаПоСсылке(ДанныеДоговора.Владелец);
				Параметры.contractTypeId = "2";
				Параметры.number = СокрЛП(СтарыйКод);
				Прокси.ContractDelete(Параметры);
				ЗаписьЖурналаРегистрации("Удаление из СУДК", УровеньЖурналаРегистрации.Информация,,, "Депозитарный договор № " + СтарыйКод + " удален из СУДК!");
			Исключение
				#Если Клиент Тогда
					Сообщить("Договор не удалось удалить из СУДК!", СтатусСообщения.ОченьВажное);
				#КонецЕсли
				ЗаписьЖурналаРегистрации("Удаление из СУДК", УровеньЖурналаРегистрации.Ошибка,,, "Договор не удалось удалить из СУДК!");
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Если (ДанныеДоговора.ТипДоговора = Перечисления.ТипыДоговоров.Депозитарный) И НЕ ДанныеДоговора.ПометкаУдаления Тогда
		Попытка
			ТипПараметра = Прокси.ФабрикаXDTO.Тип(ПространствоИмен, "ContractUpdate");
			Параметры = Прокси.ФабрикаXDTO.Создать(ТипПараметра);
			Параметры.clientId = ПолучитьИдентификаторКлиентаПоСсылке(ДанныеДоговора.Владелец);
			Параметры.contractTypeId = "2";
			Параметры.number = СокрЛП(ДанныеДоговора.Код);
			Параметры.dateBegin	= ПолучитьЗначениеДатыДляВебСервиса(ДанныеДоговора.ДатаНачалоДействия);
			Параметры.dateEnd = ПолучитьЗначениеДатыДляВебСервиса(ДанныеДоговора.ДатаОкончанияДействия);
			Прокси.ContractUpdate(Параметры);
			ЗаписьЖурналаРегистрации("Запись изменений в СУДК", УровеньЖурналаРегистрации.Информация,,, "Изменения в депозитарном договоре сохранены в СУДК");
		Исключение
			#Если Клиент Тогда
				Сообщить("Изменения в договоре не удалось сохранить в СУДК!", СтатусСообщения.ОченьВажное);
			#КонецЕсли
			ЗаписьЖурналаРегистрации("Запись изменений в СУДК",УровеньЖурналаРегистрации.Ошибка,,, "Изменения в договоре не удалось сохранить в СУДК!");
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИдентификаторКлиентаПоСсылке(КлиентСсылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыЗагрузки.Код
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Клиенты)
	|	И КодыЗагрузки.Владелец = &КлиентСсылка
	|	И КодыЗагрузки.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("КлиентСсылка", КлиентСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.Код);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначениеДатыДляВебСервиса(Знач ПараметрДата)
	
	Если ЗначениеЗаполнено(ПараметрДата) Тогда
		Возврат Формат(ПараметрДата, "ДФ=yyyy-MM-dd-HH-mm-ss");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ СЕРВИСОВ ПО КОРПОРАТИВНЫМ ДЕЙСТВИЯМ

Процедура ИнициироватьСоединение(ОбработкаВебСервисы, Параметры = Неопределено) Экспорт
	ВнешниеДанные.ИнициироватьСоединение(ОбработкаВебСервисы, "ВебСервисы", Параметры);
КонецПроцедуры

Функция РезультатОтправкиУведомленияПоВыкупам(ТаблицаОпций, РезультатЗапросаПоКлиентам, РезультатЗапросаПоДокументуКД,
	ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор, ОбработкаВебСервисы = Неопределено) Экспорт
	
	Если ОбработкаВебСервисы = Неопределено Тогда
		ИнициироватьСоединение(ОбработкаВебСервисы);
	КонецЕсли;
	
	Возврат ОбработкаВебСервисы.РезультатОтправкиУведомленияПоВыкупам(ТаблицаОпций, РезультатЗапросаПоКлиентам,
		РезультатЗапросаПоДокументуКД, ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор);
		
КонецФункции

Функция РезультатОтправкиУведомленияПоСобраниям(РезультатЗапросаПоКлиентам, РезультатЗапросаПоВопросам,
	РезультатЗапросаПоДокументуКД, ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор,
	ОбработкаВебСервисы = Неопределено) Экспорт
	
	Если ОбработкаВебСервисы = Неопределено Тогда
		ИнициироватьСоединение(ОбработкаВебСервисы);
	КонецЕсли;
	
	Возврат ОбработкаВебСервисы.РезультатОтправкиУведомленияПоСобраниям(РезультатЗапросаПоКлиентам,
		РезультатЗапросаПоВопросам, РезультатЗапросаПоДокументуКД,
		ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор);
		
КонецФункции

Функция РезультатСохраненияКорпоративногоДействияWTRC(ТаблицаКлиентов, ТаблицаРазделов, ПараметрыWebСервиса,
	УникальныйИдентификатор, ОбработкаВебСервисы = Неопределено) Экспорт
	
	Если ОбработкаВебСервисы = Неопределено Тогда
		ИнициироватьСоединение(ОбработкаВебСервисы);
	КонецЕсли;
	
	Возврат ОбработкаВебСервисы.РезультатСохраненияКорпоративногоДействияWTRC(ТаблицаКлиентов, ТаблицаРазделов,
		ПараметрыWebСервиса, УникальныйИдентификатор);
		
КонецФункции

Функция РезультатДобавленияКлиентаВСуществующееКорпоративноеДействиеWTRC(ПараметрыWebСервиса, УникальныйИдентификатор,
	ОбработкаВебСервисы = Неопределено) Экспорт
	
	Если ОбработкаВебСервисы = Неопределено Тогда
		ИнициироватьСоединение(ОбработкаВебСервисы);
	КонецЕсли;
	
	Возврат ОбработкаВебСервисы.РезультатДобавленияКлиентаВСуществующееКорпоративноеДействиеWTRC(
		ПараметрыWebСервиса, УникальныйИдентификатор);
		
КонецФункции

Функция РезультатОтправкиУведомленияПоВозвратуЧастиНалога(ТаблицаКлиентов, РезультатЗапросаПоДокументуКД,
	ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор, ВидКД, ОбработкаВебСервисы = Неопределено) Экспорт
	
	Если ОбработкаВебСервисы = Неопределено Тогда
		ИнициироватьСоединение(ОбработкаВебСервисы);
	КонецЕсли;
	
	Возврат ОбработкаВебСервисы.РезультатОтправкиУведомленияПоВозвратуЧастиНалога(ТаблицаКлиентов,
		РезультатЗапросаПоДокументуКД, ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор, ВидКД);
		
КонецФункции

Функция РезультатОтправкиУведомленияИнформационного(ИдентификаторыКлиентов, ЗаголовокСообщения, ТекстСообщения,
	УникальныйИдентификатор, ОбработкаВебСервисы = Неопределено) Экспорт
	
	Если ОбработкаВебСервисы = Неопределено Тогда
		ИнициироватьСоединение(ОбработкаВебСервисы);
	КонецЕсли;
	
	Возврат ОбработкаВебСервисы.РезультатОтправкиУведомленияИнформационного(ИдентификаторыКлиентов,
		ЗаголовокСообщения, ТекстСообщения, УникальныйИдентификатор);
		
КонецФункции

Функция РезультатОтправкиИнформационногоПисьмаКлиентам(ИдентификаторыКлиентов, ЗаголовокСообщения, ТекстСообщения, ОбработкаВебСервисы = Неопределено) Экспорт
	
	Если ОбработкаВебСервисы = Неопределено Тогда
		ИнициироватьСоединение(ОбработкаВебСервисы);
	КонецЕсли;
	
	Возврат ОбработкаВебСервисы.РезультатОтправкиИнформационногоПисьмаКлиентам(ИдентификаторыКлиентов, ЗаголовокСообщения, ТекстСообщения);
		
КонецФункции

Функция СтатусыДоставкиУведомленийОКД(ДанныеУведомлений, ОбработкаВебСервисы = Неопределено) Экспорт
	
	Если ОбработкаВебСервисы = Неопределено Тогда
		ИнициироватьСоединение(ОбработкаВебСервисы);
	КонецЕсли;
	
	Возврат ОбработкаВебСервисы.СтатусыДоставкиУведомленийОКД(ДанныеУведомлений);
		
КонецФункции

Функция УведомленияКДОтстутствующиеВ1С(ДанныеУведомлений, НачалоПериода, КонецПериода,
	ОбработкаВебСервисы = Неопределено) Экспорт
	
	Если ОбработкаВебСервисы = Неопределено Тогда
		ИнициироватьСоединение(ОбработкаВебСервисы);
	КонецЕсли;
	
	Возврат ОбработкаВебСервисы.УведомленияКДОтстутствующиеВ1С(ДанныеУведомлений, НачалоПериода, КонецПериода);
		
КонецФункции

Функция СтруктураДляСозданияКоллекции(ИмяКоллекции, ИмяЭкземпляра, ВходящаяКоллекция,
	ИмяВходящейКоллекции = "") Экспорт
	
	СтруктураКВозврату = Новый Структура();
	СтруктураКВозврату.Вставить("ИмяКоллекции", ИмяКоллекции);
	СтруктураКВозврату.Вставить("ИмяЭкземпляра", ИмяЭкземпляра);
	СтруктураКВозврату.Вставить("ВходящаяКоллекция", ВходящаяКоллекция);
	СтруктураКВозврату.Вставить("ИмяВходящейКоллекции", ИмяВходящейКоллекции);
	Возврат СтруктураКВозврату;
КонецФункции

Функция СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, Источник, ПространствоИмен, СтруктураКоллекции) Экспорт	
	ТипКоллекции = Фабрика.Тип(ПространствоИмен, СтруктураКоллекции.ИмяКоллекции);
	Коллекция = Фабрика.Создать(ТипКоллекции);					  
	Если ТипЗнч(Источник) = Тип("ТаблицаЗначений") Тогда
		Для каждого СтрокаТЧ из Источник Цикл                                    
			ТипЭкземпляра = Фабрика.Тип(ПространствоИмен, СтруктураКоллекции.ИмяЭкземпляра);
			Экземпляр = Фабрика.Создать(ТипЭкземпляра); 
			ЗаполнитьЗначенияСвойств(Экземпляр, СтрокаТЧ);                                   
			Коллекция[СтруктураКоллекции.ИмяЭкземпляра].Добавить(Экземпляр);
			
			Если НЕ СтруктураКоллекции.ВходящаяКоллекция = Неопределено Тогда
				ВходящаяКоллекция = СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, СтрокаТЧ, ПространствоИмен, СтруктураКоллекции.ВходящаяКоллекция);
				Экземпляр.Установить(СтруктураКоллекции.ИмяВходящейКоллекции, ВходящаяКоллекция);
			КонецЕсли;
			
		КонецЦикла;
	ИначеЕсли ТипЗнч(Источник) = Тип("ВыборкаИзРезультатаЗапроса") Тогда 
		Пока Источник.Следующий() Цикл
			ТипЭкземпляра = Фабрика.Тип(ПространствоИмен, СтруктураКоллекции.ИмяЭкземпляра);
			Экземпляр = Фабрика.Создать(ТипЭкземпляра); 
			ЗаполнитьЗначенияСвойств(Экземпляр, Источник);                                   
			Если НЕ СтруктураКоллекции.ВходящаяКоллекция = Неопределено Тогда
				ВыборкаСледующегоУровня = Источник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ВходящаяКоллекция = СоздатьИЗаполнитьКоллекциюОбъектаXDTO(Фабрика, ВыборкаСледующегоУровня, ПространствоИмен, СтруктураКоллекции.ВходящаяКоллекция);
				Экземпляр.Установить(СтруктураКоллекции.ИмяВходящейКоллекции, ВходящаяКоллекция);
			КонецЕсли;
			Коллекция[СтруктураКоллекции.ИмяЭкземпляра].Добавить(Экземпляр);						
		КонецЦикла;
	ИначеЕсли ТипЗнч(Источник) = Тип("СтрокаТаблицыЗначений") Тогда 
		ТипЭкземпляра = Фабрика.Тип(ПространствоИмен, СтруктураКоллекции.ИмяЭкземпляра);
		Экземпляр = Фабрика.Создать(ТипЭкземпляра);
		ЗаполнитьЗначенияСвойств(Экземпляр, Источник);
		Коллекция[СтруктураКоллекции.ИмяЭкземпляра].Добавить(Экземпляр);
	КонецЕсли;
	Возврат Коллекция;
КонецФункции

// Процедура выполняет загрузку новых заявлений на участие в оферте из кабинета клиента
// Параметры:
//	ОбработкаВебСервисы - ОбработкаОбъект - либо обработка ВебСервисы, либо обработка TEST_ВебСервисы
Процедура ЗагрузкаНовыхЗаявленийНаУчастиеВОфертеИзКабинетаКлиента(ОбработкаВебСервисы = Неопределено) Экспорт
	
	Если ОбработкаВебСервисы = Неопределено Тогда
		ИнициироватьСоединение(ОбработкаВебСервисы);
	КонецЕсли;
	
	ТаблицаЗаявлений = ОбработкаВебСервисы.НовыеЗаявленияНаУчастиеВОферте();
	ЗагруженныеЗаявления = НовыеЗаявленияПоДаннымСервиса(ТаблицаЗаявлений);
	Если ЗагруженныеЗаявления.Количество() > 0 Тогда
		ОбработкаВебСервисы.СообщитьСУДКЧтоЗаявленияНаУчастиеВОфертеЗагружены(ЗагруженныеЗаявления);
	КонецЕсли;
	
КонецПроцедуры

Функция НовыеЗаявленияПоДаннымСервиса(ТаблицаЗаявлений)
	ЗагруженныеЗаявления = Новый Массив;
	
	Для Каждого СтрокаТЗ Из ТаблицаЗаявлений Цикл
		Клиент = Справочники.Контрагенты.КлиентПоClientId(СтрокаТЗ.ClientId);
		Если Не ЗначениеЗаполнено(Клиент) Тогда
			ОписаниеОшибки = "Не удалось определить клиента по ClientID = " + СтрокаТЗ.ClientId;
			СообщитьОбОшибкеПриЗагрузкеЗаявкиНаУчастиеВОферте(СтрокаТЗ, ОписаниеОшибки);
			Продолжить;
		КонецЕсли;
		ДоговорКлиента = Справочники.ДоговорыКонтрагентов.ДоговорПоКлиенту(Клиент);
		Если Не ЗначениеЗаполнено(ДоговорКлиента) Тогда
			ОписаниеОшибки = "Не удалось найти действующий договор по клиенту = " + Строка(Клиент) 
								+ " (ClientID = " + СтрокаТЗ.ClientId + ")";
			СообщитьОбОшибкеПриЗагрузкеЗаявкиНаУчастиеВОферте(СтрокаТЗ, ОписаниеОшибки);
			Продолжить;
		КонецЕсли;
		ЦеннаяБумага = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоРегНомеруИISIN(СтрокаТЗ.ISIN, СтрокаТЗ.RegNumber);
		Если Не ЗначениеЗаполнено(ЦеннаяБумага) Тогда
			ОписаниеОшибки = "Не удалось найти ценную бумагу по ISIN = " + СтрокаТЗ.ISIN + " и регистрационному номеру = " + СтрокаТЗ.RegNumber;
			СообщитьОбОшибкеПриЗагрузкеЗаявкиНаУчастиеВОферте(СтрокаТЗ, ОписаниеОшибки);
			Продолжить;
		КонецЕсли;
		Если СуществуетЗаявлениеНаУчастиеВОферте(СтрокаТЗ.DocumentNumber, ЦеннаяБумага, 
													СтрокаТЗ.OfferDate, Клиент, СтрокаТЗ.StockBondsCount) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаявлениеОбъект = Документы.ЗаявлениеНаУчастиеВОферте.СоздатьДокумент();
		ЗаявлениеОбъект.ВходящийНомерСЭД = СтрокаТЗ.DocumentNumber;
		ЗаявлениеОбъект.ДатаОферты = СтрокаТЗ.OfferDate;
		ЗаявлениеОбъект.Клиент = Клиент;
		ЗаявлениеОбъект.ДоговорКлиента = ДоговорКлиента;
		ЗаявлениеОбъект.ЦеннаяБумага = ЦеннаяБумага;
		ЗаявлениеОбъект.КоличествоЦБ = СтрокаТЗ.StockBondsCount;
		ЗаявлениеОбъект.Дата = ТекущаяДатаСеанса();
		ЗаявлениеОбъект.ДатаСозданияВКабинетеКлиента = СтрокаТЗ.CreatedAt;
		Попытка
			ЗаявлениеОбъект.Записать();
			ЗагруженныеЗаявления.Добавить(СтрокаТЗ.DocumentId);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			СообщитьОбОшибкеПриЗагрузкеЗаявкиНаУчастиеВОферте(СтрокаТЗ, ОписаниеОшибки);
		КонецПопытки;
	КонецЦикла;
	
	Возврат ЗагруженныеЗаявления;
КонецФункции

Функция СуществуетЗаявлениеНаУчастиеВОферте(ВходящийНомерСЭД, ЦеннаяБумага, ДатаОферты, Клиент, КоличествоЦБ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Поле
	|ИЗ
	|	Документ.ЗаявлениеНаУчастиеВОферте КАК ЗаявлениеНаУчастиеВОферте
	|ГДЕ
	|	ЗаявлениеНаУчастиеВОферте.ВходящийНомерСЭД = &ВходящийНомерСЭД
	|	И ЗаявлениеНаУчастиеВОферте.Клиент = &Клиент
	|	И ЗаявлениеНаУчастиеВОферте.ЦеннаяБумага = &ЦеннаяБумага
	|	И ЗаявлениеНаУчастиеВОферте.КоличествоЦБ = &КоличествоЦБ
	|	И ЗаявлениеНаУчастиеВОферте.ДатаОферты = &ДатаОферты
	|	И Не ЗаявлениеНаУчастиеВОферте.ПометкаУдаления";
	Запрос.УстановитьПараметр("ВходящийНомерСЭД", ВходящийНомерСЭД);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	Запрос.УстановитьПараметр("ДатаОферты", ДатаОферты);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("КоличествоЦБ", КоличествоЦБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции

Процедура СообщитьОбОшибкеПриЗагрузкеЗаявкиНаУчастиеВОферте(РеквизитыЗаявки, ОписаниеОшибки)
	ИмяСобытияОшибки = "Не удалось загрузить заявление на участие в оферте из кабинета клиента";
	ОписаниеОшибкиДополненное = "При загрузке заявления с DocumentId = " + Формат(РеквизитыЗаявки.DocumentId, "ЧГ=")
								+ " произошла ошибка: " + ОписаниеОшибки;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
	ЗаписьЖурналаРегистрации(ИмяСобытияОшибки, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибкиДополненное);
КонецПроцедуры
